avrdudes/avr-libc/include/avr/ioavr128db64.h
/* NVMCTRL - Non-volatile Memory Controller */
/* NVMCTRL.CTRLA  bit masks and bit positions */
#define NVMCTRL_CMD_gm  0x7F  /* Command group mask. */
#define NVMCTRL_CMD_gp  0  /* Command group position. */
#define NVMCTRL_CMD_0_bm  (1<<0)  /* Command bit 0 mask. */
#define NVMCTRL_CMD_0_bp  0  /* Command bit 0 position. */
#define NVMCTRL_CMD_1_bm  (1<<1)  /* Command bit 1 mask. */
#define NVMCTRL_CMD_1_bp  1  /* Command bit 1 position. */
#define NVMCTRL_CMD_2_bm  (1<<2)  /* Command bit 2 mask. */
#define NVMCTRL_CMD_2_bp  2  /* Command bit 2 position. */
#define NVMCTRL_CMD_3_bm  (1<<3)  /* Command bit 3 mask. */
#define NVMCTRL_CMD_3_bp  3  /* Command bit 3 position. */
#define NVMCTRL_CMD_4_bm  (1<<4)  /* Command bit 4 mask. */
#define NVMCTRL_CMD_4_bp  4  /* Command bit 4 position. */
#define NVMCTRL_CMD_5_bm  (1<<5)  /* Command bit 5 mask. */
#define NVMCTRL_CMD_5_bp  5  /* Command bit 5 position. */
#define NVMCTRL_CMD_6_bm  (1<<6)  /* Command bit 6 mask. */
#define NVMCTRL_CMD_6_bp  6  /* Command bit 6 position. */

/* NVMCTRL.CTRLB  bit masks and bit positions */
#define NVMCTRL_APPCODEWP_bm  0x01  /* Application Code Write Protect bit mask. */
#define NVMCTRL_APPCODEWP_bp  0  /* Application Code Write Protect bit position. */
#define NVMCTRL_BOOTRP_bm  0x02  /* Boot Read Protect bit mask. */
#define NVMCTRL_BOOTRP_bp  1  /* Boot Read Protect bit position. */
#define NVMCTRL_APPDATAWP_bm  0x04  /* Application Data Write Protect bit mask. */
#define NVMCTRL_APPDATAWP_bp  2  /* Application Data Write Protect bit position. */
#define NVMCTRL_FLMAP_gm  0x30  /* Flash Mapping in Data space group mask. */
#define NVMCTRL_FLMAP_gp  4  /* Flash Mapping in Data space group position. */
#define NVMCTRL_FLMAP_0_bm  (1<<4)  /* Flash Mapping in Data space bit 0 mask. */
#define NVMCTRL_FLMAP_0_bp  4  /* Flash Mapping in Data space bit 0 position. */
#define NVMCTRL_FLMAP_1_bm  (1<<5)  /* Flash Mapping in Data space bit 1 mask. */
#define NVMCTRL_FLMAP_1_bp  5  /* Flash Mapping in Data space bit 1 position. */
#define NVMCTRL_FLMAPLOCK_bm  0x80  /* Flash Mapping Lock bit mask. */
#define NVMCTRL_FLMAPLOCK_bp  7  /* Flash Mapping Lock bit position. */

/* NVMCTRL.STATUS  bit masks and bit positions */
#define NVMCTRL_FBUSY_bm  0x01  /* Flash busy bit mask. */
#define NVMCTRL_FBUSY_bp  0  /* Flash busy bit position. */
#define NVMCTRL_EEBUSY_bm  0x02  /* EEPROM busy bit mask. */
#define NVMCTRL_EEBUSY_bp  1  /* EEPROM busy bit position. */
#define NVMCTRL_ERROR_gm  0x70  /* Write error group mask. */
#define NVMCTRL_ERROR_gp  4  /* Write error group position. */
#define NVMCTRL_ERROR_0_bm  (1<<4)  /* Write error bit 0 mask. */
#define NVMCTRL_ERROR_0_bp  4  /* Write error bit 0 position. */
#define NVMCTRL_ERROR_1_bm  (1<<5)  /* Write error bit 1 mask. */
#define NVMCTRL_ERROR_1_bp  5  /* Write error bit 1 position. */
#define NVMCTRL_ERROR_2_bm  (1<<6)  /* Write error bit 2 mask. */
#define NVMCTRL_ERROR_2_bp  6  /* Write error bit 2 position. */

/* NVMCTRL.INTCTRL  bit masks and bit positions */
#define NVMCTRL_EEREADY_bm  0x01  /* EEPROM Ready bit mask. */
#define NVMCTRL_EEREADY_bp  0  /* EEPROM Ready bit position. */

/* NVMCTRL.INTFLAGS  bit masks and bit positions */
/* NVMCTRL_EEREADY  is already defined. */


/* OPAMP - Operational Amplifier System */
/* OPAMP.CTRLA  bit masks and bit positions */
#define OPAMP_ENABLE_bm  0x01  /* Op Amp System Enable bit mask. */
#define OPAMP_ENABLE_bp  0  /* Op Amp System Enable bit position. */

/* OPAMP.DBGCTRL  bit masks and bit positions */
#define OPAMP_DBGRUN_bm  0x01  /* Run in Debug Mode bit mask. */
#define OPAMP_DBGRUN_bp  0  /* Run in Debug Mode bit position. */

/* OPAMP.TIMEBASE  bit masks and bit positions */
#define OPAMP_TIMEBASE_gm  0x7F  /* Timebase Value group mask. */
#define OPAMP_TIMEBASE_gp  0  /* Timebase Value group position. */
#define OPAMP_TIMEBASE_0_bm  (1<<0)  /* Timebase Value bit 0 mask. */
#define OPAMP_TIMEBASE_0_bp  0  /* Timebase Value bit 0 position. */
#define OPAMP_TIMEBASE_1_bm  (1<<1)  /* Timebase Value bit 1 mask. */
#define OPAMP_TIMEBASE_1_bp  1  /* Timebase Value bit 1 position. */
#define OPAMP_TIMEBASE_2_bm  (1<<2)  /* Timebase Value bit 2 mask. */
#define OPAMP_TIMEBASE_2_bp  2  /* Timebase Value bit 2 position. */
#define OPAMP_TIMEBASE_3_bm  (1<<3)  /* Timebase Value bit 3 mask. */
#define OPAMP_TIMEBASE_3_bp  3  /* Timebase Value bit 3 position. */
#define OPAMP_TIMEBASE_4_bm  (1<<4)  /* Timebase Value bit 4 mask. */
#define OPAMP_TIMEBASE_4_bp  4  /* Timebase Value bit 4 position. */
#define OPAMP_TIMEBASE_5_bm  (1<<5)  /* Timebase Value bit 5 mask. */
#define OPAMP_TIMEBASE_5_bp  5  /* Timebase Value bit 5 position. */
#define OPAMP_TIMEBASE_6_bm  (1<<6)  /* Timebase Value bit 6 mask. */
#define OPAMP_TIMEBASE_6_bp  6  /* Timebase Value bit 6 position. */

/* OPAMP.PWRCTRL  bit masks and bit positions */
#define OPAMP_IRSEL_bm  0x01  /* Input Range Select bit mask. */
#define OPAMP_IRSEL_bp  0  /* Input Range Select bit position. */

/* OPAMP.OP0CTRLA  bit masks and bit positions */
#define OPAMP_ALWAYSON_bm  0x01  /* Always On bit mask. */
#define OPAMP_ALWAYSON_bp  0  /* Always On bit position. */
#define OPAMP_EVENTEN_bm  0x02  /* Enable Events bit mask. */
#define OPAMP_EVENTEN_bp  1  /* Enable Events bit position. */
#define OPAMP_OUTMODE_gm  0x0C  /* Output Mode group mask. */
#define OPAMP_OUTMODE_gp  2  /* Output Mode group position. */
#define OPAMP_OUTMODE_0_bm  (1<<2)  /* Output Mode bit 0 mask. */
#define OPAMP_OUTMODE_0_bp  2  /* Output Mode bit 0 position. */
#define OPAMP_OUTMODE_1_bm  (1<<3)  /* Output Mode bit 1 mask. */
#define OPAMP_OUTMODE_1_bp  3  /* Output Mode bit 1 position. */
#define OPAMP_RUNSTBY_bm  0x80  /* Run in Standby Mode bit mask. */
#define OPAMP_RUNSTBY_bp  7  /* Run in Standby Mode bit position. */

/* OPAMP.OP0STATUS  bit masks and bit positions */
#define OPAMP_SETTLED_bm  0x01  /* Settled bit mask. */
#define OPAMP_SETTLED_bp  0  /* Settled bit position. */

/* OPAMP.OP0RESMUX  bit masks and bit positions */
#define OPAMP_MUXTOP_gm  0x03  /* Multiplexer Top group mask. */
#define OPAMP_MUXTOP_gp  0  /* Multiplexer Top group position. */
#define OPAMP_MUXTOP_0_bm  (1<<0)  /* Multiplexer Top bit 0 mask. */
#define OPAMP_MUXTOP_0_bp  0  /* Multiplexer Top bit 0 position. */
#define OPAMP_MUXTOP_1_bm  (1<<1)  /* Multiplexer Top bit 1 mask. */
#define OPAMP_MUXTOP_1_bp  1  /* Multiplexer Top bit 1 position. */
#define OPAMP_MUXBOT_gm  0x1C  /* Multiplexer Bottom group mask. */
#define OPAMP_MUXBOT_gp  2  /* Multiplexer Bottom group position. */
#define OPAMP_MUXBOT_0_bm  (1<<2)  /* Multiplexer Bottom bit 0 mask. */
#define OPAMP_MUXBOT_0_bp  2  /* Multiplexer Bottom bit 0 position. */
#define OPAMP_MUXBOT_1_bm  (1<<3)  /* Multiplexer Bottom bit 1 mask. */
#define OPAMP_MUXBOT_1_bp  3  /* Multiplexer Bottom bit 1 position. */
#define OPAMP_MUXBOT_2_bm  (1<<4)  /* Multiplexer Bottom bit 2 mask. */
#define OPAMP_MUXBOT_2_bp  4  /* Multiplexer Bottom bit 2 position. */
#define OPAMP_MUXWIP_gm  0xE0  /* Multiplexer Wiper selector group mask. */
#define OPAMP_MUXWIP_gp  5  /* Multiplexer Wiper selector group position. */
#define OPAMP_MUXWIP_0_bm  (1<<5)  /* Multiplexer Wiper selector bit 0 mask. */
#define OPAMP_MUXWIP_0_bp  5  /* Multiplexer Wiper selector bit 0 position. */
#define OPAMP_MUXWIP_1_bm  (1<<6)  /* Multiplexer Wiper selector bit 1 mask. */
#define OPAMP_MUXWIP_1_bp  6  /* Multiplexer Wiper selector bit 1 position. */
#define OPAMP_MUXWIP_2_bm  (1<<7)  /* Multiplexer Wiper selector bit 2 mask. */
#define OPAMP_MUXWIP_2_bp  7  /* Multiplexer Wiper selector bit 2 position. */

