avrdudes/avr-libc/include/avr/ioavr128db64.h
/*
--------------------------------------------------------------------------
ADC - Analog to Digital Converter
--------------------------------------------------------------------------
*/

/* Analog to Digital Converter */
typedef struct ADC_struct
{
    register8_t CTRLA;  /* Control A */
    register8_t CTRLB;  /* Control B */
    register8_t CTRLC;  /* Control C */
    register8_t CTRLD;  /* Control D */
    register8_t CTRLE;  /* Control E */
    register8_t SAMPCTRL;  /* Sample Control */
    register8_t reserved_1[2];
    register8_t MUXPOS;  /* Positive mux input */
    register8_t MUXNEG;  /* Negative mux input */
    register8_t COMMAND;  /* Command */
    register8_t EVCTRL;  /* Event Control */
    register8_t INTCTRL;  /* Interrupt Control */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t DBGCTRL;  /* Debug Control */
    register8_t TEMP;  /* Temporary Data */
    _WORDREGISTER(RES);  /* ADC Accumulator Result */
    _WORDREGISTER(WINLT);  /* Window comparator low threshold */
    _WORDREGISTER(WINHT);  /* Window comparator high threshold */
    register8_t reserved_2[2];
} ADC_t;

/* Conversion mode select bit group values */
typedef enum ADC_CONVMODE_VALUES_enum
{
    ADC_CONVMODE_SINGLEENDED_gv    = 0x00,  /* Single-Ended mode */
    ADC_CONVMODE_DIFF_gv           = 0x01   /* Differential mode */
} ADC_CONVMODE_values_t;

/* Conversion mode select bit group configurations*/
typedef enum ADC_CONVMODE_enum
{
    ADC_CONVMODE_SINGLEENDED_gc    = (ADC_CONVMODE_SINGLEENDED_gv << ADC_CONVMODE_bp),  /* Single-Ended mode */
    ADC_CONVMODE_DIFF_gc           = (ADC_CONVMODE_DIFF_gv << ADC_CONVMODE_bp)   /* Differential mode */
} ADC_CONVMODE_t;

/* Initial Delay Selection bit group values */
typedef enum ADC_INITDLY_VALUES_enum
{
    ADC_INITDLY_DLY0_gv            = 0x00,  /* Delay 0 CLK_ADC cycles */
    ADC_INITDLY_DLY16_gv           = 0x01,  /* Delay 16 CLK_ADC cycles */
    ADC_INITDLY_DLY32_gv           = 0x02,  /* Delay 32 CLK_ADC cycles */
    ADC_INITDLY_DLY64_gv           = 0x03,  /* Delay 64 CLK_ADC cycles */
    ADC_INITDLY_DLY128_gv          = 0x04,  /* Delay 128 CLK_ADC cycles */
    ADC_INITDLY_DLY256_gv          = 0x05   /* Delay 256 CLK_ADC cycles */
} ADC_INITDLY_values_t;

/* Initial Delay Selection bit group configurations*/
typedef enum ADC_INITDLY_enum
{
    ADC_INITDLY_DLY0_gc            = (ADC_INITDLY_DLY0_gv << ADC_INITDLY_gp),  /* Delay 0 CLK_ADC cycles */
    ADC_INITDLY_DLY16_gc           = (ADC_INITDLY_DLY16_gv << ADC_INITDLY_gp),  /* Delay 16 CLK_ADC cycles */
    ADC_INITDLY_DLY32_gc           = (ADC_INITDLY_DLY32_gv << ADC_INITDLY_gp),  /* Delay 32 CLK_ADC cycles */
    ADC_INITDLY_DLY64_gc           = (ADC_INITDLY_DLY64_gv << ADC_INITDLY_gp),  /* Delay 64 CLK_ADC cycles */
    ADC_INITDLY_DLY128_gc          = (ADC_INITDLY_DLY128_gv << ADC_INITDLY_gp),  /* Delay 128 CLK_ADC cycles */
    ADC_INITDLY_DLY256_gc          = (ADC_INITDLY_DLY256_gv << ADC_INITDLY_gp)   /* Delay 256 CLK_ADC cycles */
} ADC_INITDLY_t;

/* Analog Channel Selection Bits bit group values */
typedef enum ADC_MUXNEG_VALUES_enum
{
    ADC_MUXNEG_AIN0_gv             = 0x00,  /* ADC input pin 0 */
    ADC_MUXNEG_AIN1_gv             = 0x01,  /* ADC input pin 1 */
    ADC_MUXNEG_AIN2_gv             = 0x02,  /* ADC input pin 2 */
    ADC_MUXNEG_AIN3_gv             = 0x03,  /* ADC input pin 3 */
    ADC_MUXNEG_AIN4_gv             = 0x04,  /* ADC input pin 4 */
    ADC_MUXNEG_AIN5_gv             = 0x05,  /* ADC input pin 5 */
    ADC_MUXNEG_AIN6_gv             = 0x06,  /* ADC input pin 6 */
    ADC_MUXNEG_AIN7_gv             = 0x07,  /* ADC input pin 7 */
    ADC_MUXNEG_AIN8_gv             = 0x08,  /* ADC input pin 8 */
    ADC_MUXNEG_AIN9_gv             = 0x09,  /* ADC input pin 9 */
    ADC_MUXNEG_AIN10_gv            = 0x0A,  /* ADC input pin 10 */
    ADC_MUXNEG_AIN11_gv            = 0x0B,  /* ADC input pin 11 */
    ADC_MUXNEG_AIN12_gv            = 0x0C,  /* ADC input pin 12 */
    ADC_MUXNEG_AIN13_gv            = 0x0D,  /* ADC input pin 13 */
    ADC_MUXNEG_AIN14_gv            = 0x0E,  /* ADC input pin 14 */
    ADC_MUXNEG_AIN15_gv            = 0x0F,  /* ADC input pin 15 */
    ADC_MUXNEG_GND_gv              = 0x40,  /* Ground */
    ADC_MUXNEG_DAC0_gv             = 0x48   /* DAC0 */
} ADC_MUXNEG_values_t;

/* Analog Channel Selection Bits bit group configurations*/
typedef enum ADC_MUXNEG_enum
{
    ADC_MUXNEG_AIN0_gc             = (ADC_MUXNEG_AIN0_gv << ADC_MUXNEG_gp),  /* ADC input pin 0 */
    ADC_MUXNEG_AIN1_gc             = (ADC_MUXNEG_AIN1_gv << ADC_MUXNEG_gp),  /* ADC input pin 1 */
    ADC_MUXNEG_AIN2_gc             = (ADC_MUXNEG_AIN2_gv << ADC_MUXNEG_gp),  /* ADC input pin 2 */
    ADC_MUXNEG_AIN3_gc             = (ADC_MUXNEG_AIN3_gv << ADC_MUXNEG_gp),  /* ADC input pin 3 */
    ADC_MUXNEG_AIN4_gc             = (ADC_MUXNEG_AIN4_gv << ADC_MUXNEG_gp),  /* ADC input pin 4 */
    ADC_MUXNEG_AIN5_gc             = (ADC_MUXNEG_AIN5_gv << ADC_MUXNEG_gp),  /* ADC input pin 5 */
    ADC_MUXNEG_AIN6_gc             = (ADC_MUXNEG_AIN6_gv << ADC_MUXNEG_gp),  /* ADC input pin 6 */
    ADC_MUXNEG_AIN7_gc             = (ADC_MUXNEG_AIN7_gv << ADC_MUXNEG_gp),  /* ADC input pin 7 */
    ADC_MUXNEG_AIN8_gc             = (ADC_MUXNEG_AIN8_gv << ADC_MUXNEG_gp),  /* ADC input pin 8 */
    ADC_MUXNEG_AIN9_gc             = (ADC_MUXNEG_AIN9_gv << ADC_MUXNEG_gp),  /* ADC input pin 9 */
    ADC_MUXNEG_AIN10_gc            = (ADC_MUXNEG_AIN10_gv << ADC_MUXNEG_gp),  /* ADC input pin 10 */
    ADC_MUXNEG_AIN11_gc            = (ADC_MUXNEG_AIN11_gv << ADC_MUXNEG_gp),  /* ADC input pin 11 */
    ADC_MUXNEG_AIN12_gc            = (ADC_MUXNEG_AIN12_gv << ADC_MUXNEG_gp),  /* ADC input pin 12 */
    ADC_MUXNEG_AIN13_gc            = (ADC_MUXNEG_AIN13_gv << ADC_MUXNEG_gp),  /* ADC input pin 13 */
    ADC_MUXNEG_AIN14_gc            = (ADC_MUXNEG_AIN14_gv << ADC_MUXNEG_gp),  /* ADC input pin 14 */
    ADC_MUXNEG_AIN15_gc            = (ADC_MUXNEG_AIN15_gv << ADC_MUXNEG_gp),  /* ADC input pin 15 */
    ADC_MUXNEG_GND_gc              = (ADC_MUXNEG_GND_gv << ADC_MUXNEG_gp),  /* Ground */
    ADC_MUXNEG_DAC0_gc             = (ADC_MUXNEG_DAC0_gv << ADC_MUXNEG_gp)   /* DAC0 */
} ADC_MUXNEG_t;

