avrdudes/avr-libc/include/avr/ioavr128db64.h
/* Channel 6 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL6_enum
{
    EVSYS_CHANNEL6_OFF_gc          = (EVSYS_CHANNEL6_OFF_gv << EVSYS_CHANNEL6_gp),  /* Off */
    EVSYS_CHANNEL6_UPDI_SYNCH_gc   = (EVSYS_CHANNEL6_UPDI_SYNCH_gv << EVSYS_CHANNEL6_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL6_MVIO_gc         = (EVSYS_CHANNEL6_MVIO_gv << EVSYS_CHANNEL6_gp),  /* MVIO VDDIO2 OK */
    EVSYS_CHANNEL6_RTC_OVF_gc      = (EVSYS_CHANNEL6_RTC_OVF_gv << EVSYS_CHANNEL6_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL6_RTC_CMP_gc      = (EVSYS_CHANNEL6_RTC_CMP_gv << EVSYS_CHANNEL6_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL6_RTC_PIT_DIV8192_gc = (EVSYS_CHANNEL6_RTC_PIT_DIV8192_gv << EVSYS_CHANNEL6_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL6_RTC_PIT_DIV4096_gc = (EVSYS_CHANNEL6_RTC_PIT_DIV4096_gv << EVSYS_CHANNEL6_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL6_RTC_PIT_DIV2048_gc = (EVSYS_CHANNEL6_RTC_PIT_DIV2048_gv << EVSYS_CHANNEL6_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL6_RTC_PIT_DIV1024_gc = (EVSYS_CHANNEL6_RTC_PIT_DIV1024_gv << EVSYS_CHANNEL6_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL6_CCL_LUT0_gc     = (EVSYS_CHANNEL6_CCL_LUT0_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL6_CCL_LUT1_gc     = (EVSYS_CHANNEL6_CCL_LUT1_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL6_CCL_LUT2_gc     = (EVSYS_CHANNEL6_CCL_LUT2_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL6_CCL_LUT3_gc     = (EVSYS_CHANNEL6_CCL_LUT3_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL6_CCL_LUT4_gc     = (EVSYS_CHANNEL6_CCL_LUT4_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL6_CCL_LUT5_gc     = (EVSYS_CHANNEL6_CCL_LUT5_gv << EVSYS_CHANNEL6_gp),  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL6_AC0_OUT_gc      = (EVSYS_CHANNEL6_AC0_OUT_gv << EVSYS_CHANNEL6_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL6_AC1_OUT_gc      = (EVSYS_CHANNEL6_AC1_OUT_gv << EVSYS_CHANNEL6_gp),  /* Analog Comparator 1 out */
    EVSYS_CHANNEL6_AC2_OUT_gc      = (EVSYS_CHANNEL6_AC2_OUT_gv << EVSYS_CHANNEL6_gp),  /* Analog Comparator 2 out */
    EVSYS_CHANNEL6_ADC0_RESRDY_gc  = (EVSYS_CHANNEL6_ADC0_RESRDY_gv << EVSYS_CHANNEL6_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL6_ZCD0_gc         = (EVSYS_CHANNEL6_ZCD0_gv << EVSYS_CHANNEL6_gp),  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL6_ZCD1_gc         = (EVSYS_CHANNEL6_ZCD1_gv << EVSYS_CHANNEL6_gp),  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL6_ZCD2_gc         = (EVSYS_CHANNEL6_ZCD2_gv << EVSYS_CHANNEL6_gp),  /* Zero Cross Detect 2 out */
    EVSYS_CHANNEL6_OPAMP0_READY_gc = (EVSYS_CHANNEL6_OPAMP0_READY_gv << EVSYS_CHANNEL6_gp),  /* OPAMP0 Ready */
    EVSYS_CHANNEL6_OPAMP1_READY_gc = (EVSYS_CHANNEL6_OPAMP1_READY_gv << EVSYS_CHANNEL6_gp),  /* OPAMP1 Ready */
    EVSYS_CHANNEL6_OPAMP2_READY_gc = (EVSYS_CHANNEL6_OPAMP2_READY_gv << EVSYS_CHANNEL6_gp),  /* OPAMP2 Ready */
    EVSYS_CHANNEL6_PORTG_PIN0_gc   = (EVSYS_CHANNEL6_PORTG_PIN0_gv << EVSYS_CHANNEL6_gp),  /* Port G Pin 0 */
    EVSYS_CHANNEL6_PORTG_PIN1_gc   = (EVSYS_CHANNEL6_PORTG_PIN1_gv << EVSYS_CHANNEL6_gp),  /* Port G Pin 1 */
    EVSYS_CHANNEL6_PORTG_PIN2_gc   = (EVSYS_CHANNEL6_PORTG_PIN2_gv << EVSYS_CHANNEL6_gp),  /* Port G Pin 2 */
    EVSYS_CHANNEL6_PORTG_PIN3_gc   = (EVSYS_CHANNEL6_PORTG_PIN3_gv << EVSYS_CHANNEL6_gp),  /* Port G Pin 3 */
    EVSYS_CHANNEL6_PORTG_PIN4_gc   = (EVSYS_CHANNEL6_PORTG_PIN4_gv << EVSYS_CHANNEL6_gp),  /* Port G Pin 4 */
    EVSYS_CHANNEL6_PORTG_PIN5_gc   = (EVSYS_CHANNEL6_PORTG_PIN5_gv << EVSYS_CHANNEL6_gp),  /* Port G Pin 5 */
    EVSYS_CHANNEL6_PORTG_PIN6_gc   = (EVSYS_CHANNEL6_PORTG_PIN6_gv << EVSYS_CHANNEL6_gp),  /* Port G Pin 6 */
    EVSYS_CHANNEL6_PORTG_PIN7_gc   = (EVSYS_CHANNEL6_PORTG_PIN7_gv << EVSYS_CHANNEL6_gp),  /* Port G Pin 7 */
    EVSYS_CHANNEL6_USART0_XCK_gc   = (EVSYS_CHANNEL6_USART0_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL6_USART1_XCK_gc   = (EVSYS_CHANNEL6_USART1_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL6_USART2_XCK_gc   = (EVSYS_CHANNEL6_USART2_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 2 XCK */
    EVSYS_CHANNEL6_USART3_XCK_gc   = (EVSYS_CHANNEL6_USART3_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 3 XCK */
    EVSYS_CHANNEL6_USART4_XCK_gc   = (EVSYS_CHANNEL6_USART4_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 4 XCK */
    EVSYS_CHANNEL6_USART5_XCK_gc   = (EVSYS_CHANNEL6_USART5_XCK_gv << EVSYS_CHANNEL6_gp),  /* USART 5 XCK */
    EVSYS_CHANNEL6_SPI0_SCK_gc     = (EVSYS_CHANNEL6_SPI0_SCK_gv << EVSYS_CHANNEL6_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL6_SPI1_SCK_gc     = (EVSYS_CHANNEL6_SPI1_SCK_gv << EVSYS_CHANNEL6_gp),  /* SPI 1 SCK */
    EVSYS_CHANNEL6_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL6_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL6_TCA0_HUNF_gc    = (EVSYS_CHANNEL6_TCA0_HUNF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL6_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL6_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL6_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL6_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL6_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL6_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL6_TCA1_OVF_LUNF_gc = (EVSYS_CHANNEL6_TCA1_OVF_LUNF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL6_TCA1_HUNF_gc    = (EVSYS_CHANNEL6_TCA1_HUNF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL6_TCA1_CMP0_LCMP0_gc = (EVSYS_CHANNEL6_TCA1_CMP0_LCMP0_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL6_TCA1_CMP1_LCMP1_gc = (EVSYS_CHANNEL6_TCA1_CMP1_LCMP1_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL6_TCA1_CMP2_LCMP2_gc = (EVSYS_CHANNEL6_TCA1_CMP2_LCMP2_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL6_TCB0_CAPT_gc    = (EVSYS_CHANNEL6_TCB0_CAPT_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL6_TCB0_OVF_gc     = (EVSYS_CHANNEL6_TCB0_OVF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL6_TCB1_CAPT_gc    = (EVSYS_CHANNEL6_TCB1_CAPT_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL6_TCB1_OVF_gc     = (EVSYS_CHANNEL6_TCB1_OVF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL6_TCB2_CAPT_gc    = (EVSYS_CHANNEL6_TCB2_CAPT_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL6_TCB2_OVF_gc     = (EVSYS_CHANNEL6_TCB2_OVF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL6_TCB3_CAPT_gc    = (EVSYS_CHANNEL6_TCB3_CAPT_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL6_TCB3_OVF_gc     = (EVSYS_CHANNEL6_TCB3_OVF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL6_TCB4_CAPT_gc    = (EVSYS_CHANNEL6_TCB4_CAPT_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B4 capture */
    EVSYS_CHANNEL6_TCB4_OVF_gc     = (EVSYS_CHANNEL6_TCB4_OVF_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter B4 overflow */
    EVSYS_CHANNEL6_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL6_TCD0_CMPBCLR_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL6_TCD0_CMPASET_gc = (EVSYS_CHANNEL6_TCD0_CMPASET_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL6_TCD0_CMPBSET_gc = (EVSYS_CHANNEL6_TCD0_CMPBSET_gv << EVSYS_CHANNEL6_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL6_TCD0_PROGEV_gc  = (EVSYS_CHANNEL6_TCD0_PROGEV_gv << EVSYS_CHANNEL6_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL6_t;

/* Channel 7 generator select bit group values */
typedef enum EVSYS_CHANNEL7_VALUES_enum
{
    EVSYS_CHANNEL7_OFF_gv          = 0x00,  /* Off */
    EVSYS_CHANNEL7_UPDI_SYNCH_gv   = 0x01,  /* UPDI SYNCH character */
    EVSYS_CHANNEL7_MVIO_gv         = 0x05,  /* MVIO VDDIO2 OK */
    EVSYS_CHANNEL7_RTC_OVF_gv      = 0x06,  /* Real Time Counter overflow */
    EVSYS_CHANNEL7_RTC_CMP_gv      = 0x07,  /* Real Time Counter compare */
    EVSYS_CHANNEL7_RTC_PIT_DIV512_gv = 0x08,  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL7_RTC_PIT_DIV256_gv = 0x09,  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL7_RTC_PIT_DIV128_gv = 0x0A,  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL7_RTC_PIT_DIV64_gv = 0x0B,  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL7_CCL_LUT0_gv     = 0x10,  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL7_CCL_LUT1_gv     = 0x11,  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL7_CCL_LUT2_gv     = 0x12,  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL7_CCL_LUT3_gv     = 0x13,  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL7_CCL_LUT4_gv     = 0x14,  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL7_CCL_LUT5_gv     = 0x15,  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL7_AC0_OUT_gv      = 0x20,  /* Analog Comparator 0 out */
    EVSYS_CHANNEL7_AC1_OUT_gv      = 0x21,  /* Analog Comparator 1 out */
    EVSYS_CHANNEL7_AC2_OUT_gv      = 0x22,  /* Analog Comparator 2 out */
    EVSYS_CHANNEL7_ADC0_RESRDY_gv  = 0x24,  /* ADC 0 Result Ready */
    EVSYS_CHANNEL7_ZCD0_gv         = 0x30,  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL7_ZCD1_gv         = 0x31,  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL7_ZCD2_gv         = 0x32,  /* Zero Cross Detect 2 out */
    EVSYS_CHANNEL7_OPAMP0_READY_gv = 0x34,  /* OPAMP0 Ready */
    EVSYS_CHANNEL7_OPAMP1_READY_gv = 0x35,  /* OPAMP1 Ready */
    EVSYS_CHANNEL7_OPAMP2_READY_gv = 0x36,  /* OPAMP2 Ready */
    EVSYS_CHANNEL7_PORTG_PIN0_gv   = 0x40,  /* Port G Pin 0 */
    EVSYS_CHANNEL7_PORTG_PIN1_gv   = 0x41,  /* Port G Pin 1 */
    EVSYS_CHANNEL7_PORTG_PIN2_gv   = 0x42,  /* Port G Pin 2 */
    EVSYS_CHANNEL7_PORTG_PIN3_gv   = 0x43,  /* Port G Pin 3 */
    EVSYS_CHANNEL7_PORTG_PIN4_gv   = 0x44,  /* Port G Pin 4 */
    EVSYS_CHANNEL7_PORTG_PIN5_gv   = 0x45,  /* Port G Pin 5 */
    EVSYS_CHANNEL7_PORTG_PIN6_gv   = 0x46,  /* Port G Pin 6 */
    EVSYS_CHANNEL7_PORTG_PIN7_gv   = 0x47,  /* Port G Pin 7 */
    EVSYS_CHANNEL7_USART0_XCK_gv   = 0x60,  /* USART 0 XCK */
    EVSYS_CHANNEL7_USART1_XCK_gv   = 0x61,  /* USART 1 XCK */
    EVSYS_CHANNEL7_USART2_XCK_gv   = 0x62,  /* USART 2 XCK */
    EVSYS_CHANNEL7_USART3_XCK_gv   = 0x63,  /* USART 3 XCK */
    EVSYS_CHANNEL7_USART4_XCK_gv   = 0x64,  /* USART 4 XCK */
    EVSYS_CHANNEL7_USART5_XCK_gv   = 0x65,  /* USART 5 XCK */
    EVSYS_CHANNEL7_SPI0_SCK_gv     = 0x68,  /* SPI 0 SCK */
    EVSYS_CHANNEL7_SPI1_SCK_gv     = 0x69,  /* SPI 1 SCK */
    EVSYS_CHANNEL7_TCA0_OVF_LUNF_gv = 0x80,  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL7_TCA0_HUNF_gv    = 0x81,  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL7_TCA0_CMP0_LCMP0_gv = 0x84,  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL7_TCA0_CMP1_LCMP1_gv = 0x85,  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL7_TCA0_CMP2_LCMP2_gv = 0x86,  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL7_TCA1_OVF_LUNF_gv = 0x88,  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL7_TCA1_HUNF_gv    = 0x89,  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL7_TCA1_CMP0_LCMP0_gv = 0x8C,  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL7_TCA1_CMP1_LCMP1_gv = 0x8D,  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL7_TCA1_CMP2_LCMP2_gv = 0x8E,  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL7_TCB0_CAPT_gv    = 0xA0,  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL7_TCB0_OVF_gv     = 0xA1,  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL7_TCB1_CAPT_gv    = 0xA2,  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL7_TCB1_OVF_gv     = 0xA3,  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL7_TCB2_CAPT_gv    = 0xA4,  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL7_TCB2_OVF_gv     = 0xA5,  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL7_TCB3_CAPT_gv    = 0xA6,  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL7_TCB3_OVF_gv     = 0xA7,  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL7_TCB4_CAPT_gv    = 0xA8,  /* Timer/Counter B4 capture */
    EVSYS_CHANNEL7_TCB4_OVF_gv     = 0xA9,  /* Timer/Counter B4 overflow */
    EVSYS_CHANNEL7_TCD0_CMPBCLR_gv = 0xB0,  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL7_TCD0_CMPASET_gv = 0xB1,  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL7_TCD0_CMPBSET_gv = 0xB2,  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL7_TCD0_PROGEV_gv  = 0xB3   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL7_values_t;

/* Channel 7 generator select bit group configurations*/
typedef enum EVSYS_CHANNEL7_enum
{
    EVSYS_CHANNEL7_OFF_gc          = (EVSYS_CHANNEL7_OFF_gv << EVSYS_CHANNEL7_gp),  /* Off */
    EVSYS_CHANNEL7_UPDI_SYNCH_gc   = (EVSYS_CHANNEL7_UPDI_SYNCH_gv << EVSYS_CHANNEL7_gp),  /* UPDI SYNCH character */
    EVSYS_CHANNEL7_MVIO_gc         = (EVSYS_CHANNEL7_MVIO_gv << EVSYS_CHANNEL7_gp),  /* MVIO VDDIO2 OK */
    EVSYS_CHANNEL7_RTC_OVF_gc      = (EVSYS_CHANNEL7_RTC_OVF_gv << EVSYS_CHANNEL7_gp),  /* Real Time Counter overflow */
    EVSYS_CHANNEL7_RTC_CMP_gc      = (EVSYS_CHANNEL7_RTC_CMP_gv << EVSYS_CHANNEL7_gp),  /* Real Time Counter compare */
    EVSYS_CHANNEL7_RTC_PIT_DIV512_gc = (EVSYS_CHANNEL7_RTC_PIT_DIV512_gv << EVSYS_CHANNEL7_gp),  /* Periodic Interrupt Timer output 0 */
    EVSYS_CHANNEL7_RTC_PIT_DIV256_gc = (EVSYS_CHANNEL7_RTC_PIT_DIV256_gv << EVSYS_CHANNEL7_gp),  /* Periodic Interrupt Timer output 1 */
    EVSYS_CHANNEL7_RTC_PIT_DIV128_gc = (EVSYS_CHANNEL7_RTC_PIT_DIV128_gv << EVSYS_CHANNEL7_gp),  /* Periodic Interrupt Timer output 2 */
    EVSYS_CHANNEL7_RTC_PIT_DIV64_gc = (EVSYS_CHANNEL7_RTC_PIT_DIV64_gv << EVSYS_CHANNEL7_gp),  /* Periodic Interrupt Timer output 3 */
    EVSYS_CHANNEL7_CCL_LUT0_gc     = (EVSYS_CHANNEL7_CCL_LUT0_gv << EVSYS_CHANNEL7_gp),  /* Configurable Custom Logic LUT0 */
    EVSYS_CHANNEL7_CCL_LUT1_gc     = (EVSYS_CHANNEL7_CCL_LUT1_gv << EVSYS_CHANNEL7_gp),  /* Configurable Custom Logic LUT1 */
    EVSYS_CHANNEL7_CCL_LUT2_gc     = (EVSYS_CHANNEL7_CCL_LUT2_gv << EVSYS_CHANNEL7_gp),  /* Configurable Custom Logic LUT2 */
    EVSYS_CHANNEL7_CCL_LUT3_gc     = (EVSYS_CHANNEL7_CCL_LUT3_gv << EVSYS_CHANNEL7_gp),  /* Configurable Custom Logic LUT3 */
    EVSYS_CHANNEL7_CCL_LUT4_gc     = (EVSYS_CHANNEL7_CCL_LUT4_gv << EVSYS_CHANNEL7_gp),  /* Configurable Custom Logic LUT4 */
    EVSYS_CHANNEL7_CCL_LUT5_gc     = (EVSYS_CHANNEL7_CCL_LUT5_gv << EVSYS_CHANNEL7_gp),  /* Configurable Custom Logic LUT5 */
    EVSYS_CHANNEL7_AC0_OUT_gc      = (EVSYS_CHANNEL7_AC0_OUT_gv << EVSYS_CHANNEL7_gp),  /* Analog Comparator 0 out */
    EVSYS_CHANNEL7_AC1_OUT_gc      = (EVSYS_CHANNEL7_AC1_OUT_gv << EVSYS_CHANNEL7_gp),  /* Analog Comparator 1 out */
    EVSYS_CHANNEL7_AC2_OUT_gc      = (EVSYS_CHANNEL7_AC2_OUT_gv << EVSYS_CHANNEL7_gp),  /* Analog Comparator 2 out */
    EVSYS_CHANNEL7_ADC0_RESRDY_gc  = (EVSYS_CHANNEL7_ADC0_RESRDY_gv << EVSYS_CHANNEL7_gp),  /* ADC 0 Result Ready */
    EVSYS_CHANNEL7_ZCD0_gc         = (EVSYS_CHANNEL7_ZCD0_gv << EVSYS_CHANNEL7_gp),  /* Zero Cross Detect 0 out */
    EVSYS_CHANNEL7_ZCD1_gc         = (EVSYS_CHANNEL7_ZCD1_gv << EVSYS_CHANNEL7_gp),  /* Zero Cross Detect 1 out */
    EVSYS_CHANNEL7_ZCD2_gc         = (EVSYS_CHANNEL7_ZCD2_gv << EVSYS_CHANNEL7_gp),  /* Zero Cross Detect 2 out */
    EVSYS_CHANNEL7_OPAMP0_READY_gc = (EVSYS_CHANNEL7_OPAMP0_READY_gv << EVSYS_CHANNEL7_gp),  /* OPAMP0 Ready */
    EVSYS_CHANNEL7_OPAMP1_READY_gc = (EVSYS_CHANNEL7_OPAMP1_READY_gv << EVSYS_CHANNEL7_gp),  /* OPAMP1 Ready */
    EVSYS_CHANNEL7_OPAMP2_READY_gc = (EVSYS_CHANNEL7_OPAMP2_READY_gv << EVSYS_CHANNEL7_gp),  /* OPAMP2 Ready */
    EVSYS_CHANNEL7_PORTG_PIN0_gc   = (EVSYS_CHANNEL7_PORTG_PIN0_gv << EVSYS_CHANNEL7_gp),  /* Port G Pin 0 */
    EVSYS_CHANNEL7_PORTG_PIN1_gc   = (EVSYS_CHANNEL7_PORTG_PIN1_gv << EVSYS_CHANNEL7_gp),  /* Port G Pin 1 */
    EVSYS_CHANNEL7_PORTG_PIN2_gc   = (EVSYS_CHANNEL7_PORTG_PIN2_gv << EVSYS_CHANNEL7_gp),  /* Port G Pin 2 */
    EVSYS_CHANNEL7_PORTG_PIN3_gc   = (EVSYS_CHANNEL7_PORTG_PIN3_gv << EVSYS_CHANNEL7_gp),  /* Port G Pin 3 */
    EVSYS_CHANNEL7_PORTG_PIN4_gc   = (EVSYS_CHANNEL7_PORTG_PIN4_gv << EVSYS_CHANNEL7_gp),  /* Port G Pin 4 */
    EVSYS_CHANNEL7_PORTG_PIN5_gc   = (EVSYS_CHANNEL7_PORTG_PIN5_gv << EVSYS_CHANNEL7_gp),  /* Port G Pin 5 */
    EVSYS_CHANNEL7_PORTG_PIN6_gc   = (EVSYS_CHANNEL7_PORTG_PIN6_gv << EVSYS_CHANNEL7_gp),  /* Port G Pin 6 */
    EVSYS_CHANNEL7_PORTG_PIN7_gc   = (EVSYS_CHANNEL7_PORTG_PIN7_gv << EVSYS_CHANNEL7_gp),  /* Port G Pin 7 */
    EVSYS_CHANNEL7_USART0_XCK_gc   = (EVSYS_CHANNEL7_USART0_XCK_gv << EVSYS_CHANNEL7_gp),  /* USART 0 XCK */
    EVSYS_CHANNEL7_USART1_XCK_gc   = (EVSYS_CHANNEL7_USART1_XCK_gv << EVSYS_CHANNEL7_gp),  /* USART 1 XCK */
    EVSYS_CHANNEL7_USART2_XCK_gc   = (EVSYS_CHANNEL7_USART2_XCK_gv << EVSYS_CHANNEL7_gp),  /* USART 2 XCK */
    EVSYS_CHANNEL7_USART3_XCK_gc   = (EVSYS_CHANNEL7_USART3_XCK_gv << EVSYS_CHANNEL7_gp),  /* USART 3 XCK */
    EVSYS_CHANNEL7_USART4_XCK_gc   = (EVSYS_CHANNEL7_USART4_XCK_gv << EVSYS_CHANNEL7_gp),  /* USART 4 XCK */
    EVSYS_CHANNEL7_USART5_XCK_gc   = (EVSYS_CHANNEL7_USART5_XCK_gv << EVSYS_CHANNEL7_gp),  /* USART 5 XCK */
    EVSYS_CHANNEL7_SPI0_SCK_gc     = (EVSYS_CHANNEL7_SPI0_SCK_gv << EVSYS_CHANNEL7_gp),  /* SPI 0 SCK */
    EVSYS_CHANNEL7_SPI1_SCK_gc     = (EVSYS_CHANNEL7_SPI1_SCK_gv << EVSYS_CHANNEL7_gp),  /* SPI 1 SCK */
    EVSYS_CHANNEL7_TCA0_OVF_LUNF_gc = (EVSYS_CHANNEL7_TCA0_OVF_LUNF_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter A0 overflow / low byte timer underflow */
    EVSYS_CHANNEL7_TCA0_HUNF_gc    = (EVSYS_CHANNEL7_TCA0_HUNF_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter A0 high byte timer underflow */
    EVSYS_CHANNEL7_TCA0_CMP0_LCMP0_gc = (EVSYS_CHANNEL7_TCA0_CMP0_LCMP0_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter A0 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL7_TCA0_CMP1_LCMP1_gc = (EVSYS_CHANNEL7_TCA0_CMP1_LCMP1_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter A0 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL7_TCA0_CMP2_LCMP2_gc = (EVSYS_CHANNEL7_TCA0_CMP2_LCMP2_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter A0 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL7_TCA1_OVF_LUNF_gc = (EVSYS_CHANNEL7_TCA1_OVF_LUNF_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter A1 overflow / low byte timer underflow */
    EVSYS_CHANNEL7_TCA1_HUNF_gc    = (EVSYS_CHANNEL7_TCA1_HUNF_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter A1 high byte timer underflow */
    EVSYS_CHANNEL7_TCA1_CMP0_LCMP0_gc = (EVSYS_CHANNEL7_TCA1_CMP0_LCMP0_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter A1 compare 0 / low byte timer compare 0 */
    EVSYS_CHANNEL7_TCA1_CMP1_LCMP1_gc = (EVSYS_CHANNEL7_TCA1_CMP1_LCMP1_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter A1 compare 1 / low byte timer compare 1 */
    EVSYS_CHANNEL7_TCA1_CMP2_LCMP2_gc = (EVSYS_CHANNEL7_TCA1_CMP2_LCMP2_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter A1 compare 2 / low byte timer compare 2 */
    EVSYS_CHANNEL7_TCB0_CAPT_gc    = (EVSYS_CHANNEL7_TCB0_CAPT_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter B0 capture */
    EVSYS_CHANNEL7_TCB0_OVF_gc     = (EVSYS_CHANNEL7_TCB0_OVF_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter B0 overflow */
    EVSYS_CHANNEL7_TCB1_CAPT_gc    = (EVSYS_CHANNEL7_TCB1_CAPT_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter B1 capture */
    EVSYS_CHANNEL7_TCB1_OVF_gc     = (EVSYS_CHANNEL7_TCB1_OVF_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter B1 overflow */
    EVSYS_CHANNEL7_TCB2_CAPT_gc    = (EVSYS_CHANNEL7_TCB2_CAPT_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter B2 capture */
    EVSYS_CHANNEL7_TCB2_OVF_gc     = (EVSYS_CHANNEL7_TCB2_OVF_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter B2 overflow */
    EVSYS_CHANNEL7_TCB3_CAPT_gc    = (EVSYS_CHANNEL7_TCB3_CAPT_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter B3 capture */
    EVSYS_CHANNEL7_TCB3_OVF_gc     = (EVSYS_CHANNEL7_TCB3_OVF_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter B3 overflow */
    EVSYS_CHANNEL7_TCB4_CAPT_gc    = (EVSYS_CHANNEL7_TCB4_CAPT_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter B4 capture */
    EVSYS_CHANNEL7_TCB4_OVF_gc     = (EVSYS_CHANNEL7_TCB4_OVF_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter B4 overflow */
    EVSYS_CHANNEL7_TCD0_CMPBCLR_gc = (EVSYS_CHANNEL7_TCD0_CMPBCLR_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter D0 event 0 */
    EVSYS_CHANNEL7_TCD0_CMPASET_gc = (EVSYS_CHANNEL7_TCD0_CMPASET_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter D0 event 1 */
    EVSYS_CHANNEL7_TCD0_CMPBSET_gc = (EVSYS_CHANNEL7_TCD0_CMPBSET_gv << EVSYS_CHANNEL7_gp),  /* Timer/Counter D0 event 2 */
    EVSYS_CHANNEL7_TCD0_PROGEV_gc  = (EVSYS_CHANNEL7_TCD0_PROGEV_gv << EVSYS_CHANNEL7_gp)   /* Timer/Counter D0 event 3 */
} EVSYS_CHANNEL7_t;

