avrdudes/avr-libc/include/avr/ioavr128db64.h
/* Multiplexer Wiper selector bit group configurations*/
typedef enum OPAMP_OP2RESMUX_MUXWIP_enum
{
    OPAMP_OP2RESMUX_MUXWIP_WIP0_gc = (OPAMP_OP2RESMUX_MUXWIP_WIP0_gv << OPAMP_MUXWIP_gp),  /* R1 = 15R, R2 = 1R, R2/R1 = 0.07 */
    OPAMP_OP2RESMUX_MUXWIP_WIP1_gc = (OPAMP_OP2RESMUX_MUXWIP_WIP1_gv << OPAMP_MUXWIP_gp),  /* R1 = 14R, R2 = 2R, R2/R1 = 0.14 */
    OPAMP_OP2RESMUX_MUXWIP_WIP2_gc = (OPAMP_OP2RESMUX_MUXWIP_WIP2_gv << OPAMP_MUXWIP_gp),  /* R1 = 12R, R2 = 4R, R2/R1 = 0.33 */
    OPAMP_OP2RESMUX_MUXWIP_WIP3_gc = (OPAMP_OP2RESMUX_MUXWIP_WIP3_gv << OPAMP_MUXWIP_gp),  /* R1 = 8R, R2 = 8R, R2/R1 = 1 */
    OPAMP_OP2RESMUX_MUXWIP_WIP4_gc = (OPAMP_OP2RESMUX_MUXWIP_WIP4_gv << OPAMP_MUXWIP_gp),  /* R1 = 6R, R2 = 10R, R2/R1 = 1.67 */
    OPAMP_OP2RESMUX_MUXWIP_WIP5_gc = (OPAMP_OP2RESMUX_MUXWIP_WIP5_gv << OPAMP_MUXWIP_gp),  /* R1 = 4R, R2 = 12R, R2/R1 = 3 */
    OPAMP_OP2RESMUX_MUXWIP_WIP6_gc = (OPAMP_OP2RESMUX_MUXWIP_WIP6_gv << OPAMP_MUXWIP_gp),  /* R1 = 2R, R2 = 14R, R2/R1 = 7 */
    OPAMP_OP2RESMUX_MUXWIP_WIP7_gc = (OPAMP_OP2RESMUX_MUXWIP_WIP7_gv << OPAMP_MUXWIP_gp)   /* R1 = 1R, R2 = 15R, R2/R1 = 15 */
} OPAMP_OP2RESMUX_MUXWIP_t;

/* Input Range Select bit group values */
typedef enum OPAMP_PWRCTRL_IRSEL_VALUES_enum
{
    OPAMP_PWRCTRL_IRSEL_FULL_gv    = 0x00,  /* Full Input Range */
    OPAMP_PWRCTRL_IRSEL_REDUCED_gv = 0x01   /* Reduced Input Range */
} OPAMP_PWRCTRL_IRSEL_values_t;

/* Input Range Select bit group configurations*/
typedef enum OPAMP_PWRCTRL_IRSEL_enum
{
    OPAMP_PWRCTRL_IRSEL_FULL_gc    = (OPAMP_PWRCTRL_IRSEL_FULL_gv << OPAMP_IRSEL_bp),  /* Full Input Range */
    OPAMP_PWRCTRL_IRSEL_REDUCED_gc = (OPAMP_PWRCTRL_IRSEL_REDUCED_gv << OPAMP_IRSEL_bp)   /* Reduced Input Range */
} OPAMP_PWRCTRL_IRSEL_t;

/*
--------------------------------------------------------------------------
PORT - I/O Ports
--------------------------------------------------------------------------
*/

/* I/O Ports */
typedef struct PORT_struct
{
    register8_t DIR;  /* Data Direction */
    register8_t DIRSET;  /* Data Direction Set */
    register8_t DIRCLR;  /* Data Direction Clear */
    register8_t DIRTGL;  /* Data Direction Toggle */
    register8_t OUT;  /* Output Value */
    register8_t OUTSET;  /* Output Value Set */
    register8_t OUTCLR;  /* Output Value Clear */
    register8_t OUTTGL;  /* Output Value Toggle */
    register8_t IN;  /* Input Value */
    register8_t INTFLAGS;  /* Interrupt Flags */
    register8_t PORTCTRL;  /* Port Control */
    register8_t PINCONFIG;  /* Pin Control Config */
    register8_t PINCTRLUPD;  /* Pin Control Update */
    register8_t PINCTRLSET;  /* Pin Control Set */
    register8_t PINCTRLCLR;  /* Pin Control Clear */
    register8_t reserved_1[1];
    register8_t PIN0CTRL;  /* Pin 0 Control */
    register8_t PIN1CTRL;  /* Pin 1 Control */
    register8_t PIN2CTRL;  /* Pin 2 Control */
    register8_t PIN3CTRL;  /* Pin 3 Control */
    register8_t PIN4CTRL;  /* Pin 4 Control */
    register8_t PIN5CTRL;  /* Pin 5 Control */
    register8_t PIN6CTRL;  /* Pin 6 Control */
    register8_t PIN7CTRL;  /* Pin 7 Control */
    register8_t reserved_2[8];
} PORT_t;

/* Input/Sense Configuration select bit group values */
typedef enum PORT_ISC_VALUES_enum
{
    PORT_ISC_INTDISABLE_gv         = 0x00,  /* Interrupt disabled but input buffer enabled */
    PORT_ISC_BOTHEDGES_gv          = 0x01,  /* Sense Both Edges */
    PORT_ISC_RISING_gv             = 0x02,  /* Sense Rising Edge */
    PORT_ISC_FALLING_gv            = 0x03,  /* Sense Falling Edge */
    PORT_ISC_INPUT_DISABLE_gv      = 0x04,  /* Digital Input Buffer disabled */
    PORT_ISC_LEVEL_gv              = 0x05   /* Sense low Level */
} PORT_ISC_values_t;

/* Input/Sense Configuration select bit group configurations*/
typedef enum PORT_ISC_enum
{
    PORT_ISC_INTDISABLE_gc         = (PORT_ISC_INTDISABLE_gv << PORT_ISC_gp),  /* Interrupt disabled but input buffer enabled */
    PORT_ISC_BOTHEDGES_gc          = (PORT_ISC_BOTHEDGES_gv << PORT_ISC_gp),  /* Sense Both Edges */
    PORT_ISC_RISING_gc             = (PORT_ISC_RISING_gv << PORT_ISC_gp),  /* Sense Rising Edge */
    PORT_ISC_FALLING_gc            = (PORT_ISC_FALLING_gv << PORT_ISC_gp),  /* Sense Falling Edge */
    PORT_ISC_INPUT_DISABLE_gc      = (PORT_ISC_INPUT_DISABLE_gv << PORT_ISC_gp),  /* Digital Input Buffer disabled */
    PORT_ISC_LEVEL_gc              = (PORT_ISC_LEVEL_gv << PORT_ISC_gp)   /* Sense low Level */
} PORT_ISC_t;

/*
--------------------------------------------------------------------------
PORTMUX - Port Multiplexer
--------------------------------------------------------------------------
*/

/* Port Multiplexer */
typedef struct PORTMUX_struct
{
    register8_t EVSYSROUTEA;  /* EVSYS route A */
    register8_t CCLROUTEA;  /* CCL route A */
    register8_t USARTROUTEA;  /* USART route A */
    register8_t USARTROUTEB;  /* USART route B */
    register8_t SPIROUTEA;  /* SPI route A */
    register8_t TWIROUTEA;  /* TWI route A */
    register8_t TCAROUTEA;  /* TCA route A */
    register8_t TCBROUTEA;  /* TCB route A */
    register8_t TCDROUTEA;  /* TCD route A */
    register8_t ACROUTEA;  /* AC route A */
    register8_t ZCDROUTEA;  /* ZCD route A */
    register8_t reserved_1[5];
} PORTMUX_t;

/* Analog Comparator 0 Output select bit group values */
typedef enum PORTMUX_AC0_VALUES_enum
{
    PORTMUX_AC0_DEFAULT_gv         = 0x00,  /* OUT: PA7 */
    PORTMUX_AC0_ALT1_gv            = 0x01   /* OUT: PC6 */
} PORTMUX_AC0_values_t;

/* Analog Comparator 0 Output select bit group configurations*/
typedef enum PORTMUX_AC0_enum
{
    PORTMUX_AC0_DEFAULT_gc         = (PORTMUX_AC0_DEFAULT_gv << PORTMUX_AC0_bp),  /* OUT: PA7 */
    PORTMUX_AC0_ALT1_gc            = (PORTMUX_AC0_ALT1_gv << PORTMUX_AC0_bp)   /* OUT: PC6 */
} PORTMUX_AC0_t;

/* Analog Comparator 1 Output select bit group values */
typedef enum PORTMUX_AC1_VALUES_enum
{
    PORTMUX_AC1_DEFAULT_gv         = 0x00,  /* OUT: PA7 */
    PORTMUX_AC1_ALT1_gv            = 0x01   /* OUT: PC6 */
} PORTMUX_AC1_values_t;

/* Analog Comparator 1 Output select bit group configurations*/
typedef enum PORTMUX_AC1_enum
{
    PORTMUX_AC1_DEFAULT_gc         = (PORTMUX_AC1_DEFAULT_gv << PORTMUX_AC1_bp),  /* OUT: PA7 */
    PORTMUX_AC1_ALT1_gc            = (PORTMUX_AC1_ALT1_gv << PORTMUX_AC1_bp)   /* OUT: PC6 */
} PORTMUX_AC1_t;

